<template>
  <div class="about">
    <h5>Работа с базой правил</h5>
    <p>
      В базе правил хранится список высказываний, состоящих условий. Условие
      в свою очередь указывает лингвистическую переменную и терм, который
      будет проверяться в правиле.
    </p>
    <p>
      Для перехода в базу правил, нажмите на пункт в меню "Экспертная система".
    </p>
    <div class="img-wrapper">
      <img src="images/expert-button.png" alt="#">
    </div>
    <p>
      Выберите нужное правило из списка, либо создайте новое, нажав "Создать правило"
    </p>
    <div class="img-wrapper">
      <img src="images/expert-rules.png" alt="#">
    </div>
    <p>
      При добавлении правила требуется выбрать нужный терм для каждой
      лингвистической пременной, после чего указать соответствующие
      параметры.
    </p>
    <div class="img-wrapper">
      <img src="images/expert-rule.png" alt="#">
    </div>
    <p>
      После сохранения, правило появится в списке.
    </p>
    <h5>Работа с дисциплинами</h5>
    <p>
      Для открытия списка дисциплин выберите вкладку "Дисциплины" в меню.
    </p>
    <p>
      Будет открыто окно со списком всех доступных дисциплин. Также, можно создать новую дисциплину, заполнив соответствующие поля в поле создания и нажав кнопку "Сохранить".
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines.png" alt="#">
    </div>
    <p>
      Нажав кнопку "Результаты" на одной из дисциплин, откроется окно с просмотром результатов 
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-results.png" alt="#">
    </div>
    <p>
      Нажав кнопку "Редактировать" на одной из дисциплин, откроется страница редактирования дисциплины 
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit.png" alt="#">
    </div>
    <p>
      Здесь можно поменять название дисциплины, краткое название.
    </p>
    <p>
      Нажав кнопку "Создать тему", появляется окно, в которое необходимо заполнить информацию о новой теме, и нажав кнопку "Сохранить", новая тема появится в списке.
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit-new-theme.png" alt="#">
    </div>
    <p>
      После появления темы в списке, можно добавить тестовый и обучающий материал. Раскройте нужную тему, нажав на инонку стрелочки в правой части нужной темы, и нажмите кнопку "Добавить обучающий материал с новой сложностью"
      В открывшемся окне необходимо выбрать сложность темы из выпадающего списка, и прикрепить файл в формате .pdf, содержащий в себе обучающий материал, который будет отображен обучающемуся.
      Далее, нажмите кнопку "Сохранить".
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit-edit-theme.png" alt="#">
    </div>
    <p>
      Далее необходимо заполнить тестовый материал для новой темы. Для этого, раскройте нужную тему и нажмите на кнопку "Редактировать тест". 
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit-edit-test-select.png" alt="#">
    </div>
    <p>
      Откроется редактор тестовых материалов. Здесь необходимо заполнить поле "Название теста", а также составить список вопросов. В каждом из вопросов необходимо заполнить поле с текстом вопроса, создать ответы, нажав на кнопку "Создать ответ", и выбрать один правильный ответ. Также, можно добавить картинку к вопросу или любому ответу, нажав на соответствующую иконку плюса. Это действие опционально. Создать вопрос можно нажав на кнопку "Создать вопрос". После добавления всех необходимых вопросов, нажмите на кнопку "Сохранить изменения".
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit-edit-test.png" alt="#">
    </div>
    <p>
      Для добавления новых обучающихся к вашей дисциплине, нажмите на кнопку "Управление доступом" на странице редактирования дисциплины. Откроется страница со всеми пользователями, которым видна ваша дисциплина в верхней части экрана, и со всеми остальными пользователями в нижней. Добавить обучающегося из нижней части экрана в вашу дисциплину можно нажав иконку плюса в правой части необходимого пользователя.
    </p>
    <div class="img-wrapper">
      <img src="images/expert-disciplines-edit-users.png" alt="#">
    </div>
  </div>
</template>

<style lang="scss" scoped>
.about {
  h5 {
    font-size: 24px;
    height: fit-content;  
    width: fit-content;
    color: #616161;
    margin-bottom: 16px;
  }

  p {
    font-size: 16px;
  }

  .img-wrapper {
    width: 100%;
    display: flex;
    justify-content: center;
    margin-bottom: 16px;

    img {
      max-width: 100%;
    }
  }
}
</style>